import React from "react";
import { Box, Typography } from "@mui/material";
import { Header } from "@/components/layout/header";
import Footer from "@/components/layout/footer";
import GreenStar from "@/components/icons/star";

interface ServiceTermsProps {
     terms: string[];
}

const ServiceTerms: React.FC<ServiceTermsProps> = ({ terms }) => {
     return (
          <>
               <Header />
               <Box
                    sx={{
                         marginBottom: "50px",
                         justifyContent: "center",
                         justifyItems: "center",
                    }}
               >
                    {" "}
                    <Box
                         sx={{
                              display: "flex",
                              flexDirection: "column",
                              justifyContent: "center",
                              justifyItems: "center",
                              alignItems: "center",
                         }}
                    >
                         <Box
                              sx={{
                                   display: "flex",
                                   justifyContent: "space-between",
                                   alignItems: "center",
                                   py: 4,
                                   pr: 5,
                                   mx: "auto",
                                   width: "78%",
                                   flexWrap: "wrap",
                              }}
                         >
                              <GreenStar />
                              <Typography
                                   variant="h5"
                                   component="h1"
                                   sx={{ flex: 1, maxWidth: "100%" }}
                              >
                                   Үйлчилгээний нөхцөл
                              </Typography>
                         </Box>
                         <Box
                              sx={{
                                   mx: "auto",
                                   mt: 6,
                                   width: "80%",
                                   maxWidth: "100%",
                              }}
                         >
                              {terms.map((term, index) => (
                                   <Typography
                                        key={index}
                                        variant="body1"
                                        component="p"
                                        sx={{
                                             textAlign: "justify",
                                             mb: 2,
                                             width: "70%",
                                             lineHeight: "30px",
                                             fontWeight: 400,
                                             fontSize: "18px",

                                             overflowX: "hidden",
                                        }}
                                   >
                                        {term}
                                   </Typography>
                              ))}
                         </Box>
                    </Box>
               </Box>

               <Footer />
          </>
     );
};

const Terms: React.FC = () => {
     const serviceTerms = [
          "Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.",
          "Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ.",
          "Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.",
          "Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.",
          "Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ.",
          "Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.",
          "Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.",
          "Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ.",
          "Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.",
          "Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.",
          "Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ.",
          "Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.",
          "Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.",
          "Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ.",
          "Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.",
          "Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ.",
          "Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.",
     ];

     return <ServiceTerms terms={serviceTerms} />;
};

export default Terms;
